packages/napy/napy-0.2.1-py3-none-any.whl/README.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2018-12-22 Sat 22:17 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Napy</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Nasy">
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<header>
<h1 class="title">Napy</h1>
</header><nav id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org170796e">Prologue</a></li>
<li><a href="#org0cdfe61">Introduction</a></li>
<li><a href="#org4c0f633">Usage</a>
<ul>
<li><a href="#org8244214">Tools (Libs)</a>
<ul>
<li><a href="#orgb869486">Utility</a>
<ul>
<li><a href="#org17b12e0">Flatten</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org0125dcb">Comand Line Tools</a>
<ul>
<li><a href="#orgd6f4dde">Template</a>
<ul>
<li><a href="#orgf74b16a">Crawler</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgf70df2c">More</a></li>
</ul>
</li>
<li><a href="#orgbfc6b24">Packages</a>
<ul>
<li><a href="#org36ee374">Normal</a></li>
<li><a href="#orgd37fc2d">Science</a></li>
<li><a href="#org731cb5c">Crawler</a></li>
<li><a href="#org4368085">Development</a></li>
</ul>
</li>
<li><a href="#org746629e">Epoligue</a>
<ul>
<li><a href="#org99c0952">History</a>
<ul>
<li><a href="#orgb1967c6">0.2.1 <span class="timestamp-wrapper"><span class="timestamp">&lt;2018-12-22 Sat&gt;</span></span></a></li>
<li><a href="#orgdf92ad6">0.1.1 <span class="timestamp-wrapper"><span class="timestamp">&lt;2018-12-17 Mon&gt;</span></span></a></li>
<li><a href="#org9172853">0.1.0 <span class="timestamp-wrapper"><span class="timestamp">&lt;2018-12-16 Sun&gt;</span></span></a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</nav>
<p>
Here is everything frequently use in python.
</p>

<div id="outline-container-org170796e" class="outline-2">
<h2 id="org170796e">Prologue</h2>
<div class="outline-text-2" id="text-org170796e">
<p>
I often need to configure a new Python development environment.  Whether it is to help others or for
myself, it is very troublesome to manage packages with pip.  Besides, there are fascinating and
impressive ipython extensions, and every installation of them has to bother Google again.
</p>

<p>
Therefore, I created this napy.
</p>

<p>
<i>This package is still under development, and although is only for myself now, you can use it as you
like.</i>
</p>
</div>
</div>

<div id="outline-container-org0cdfe61" class="outline-2">
<h2 id="org0cdfe61">Introduction</h2>
<div class="outline-text-2" id="text-org0cdfe61">
<p>
Napy includes some packages that I frequently use in python, such as <code>requests</code>, for crawlers; <code>sympy</code>
for mathematics.  Also, napy has some ipython extensions I write.  A template Napy also has that I
often use (of course, it's still straightforward now).  Hope you like it.
</p>

<p>
<i>Due to the <code>.dir-local.el</code> contains <code>(org-html-klipsify-src . nil)</code>, it is warning that it is not safe.</i>
</p>
</div>
</div>

<div id="outline-container-org4c0f633" class="outline-2">
<h2 id="org4c0f633">Usage</h2>
<div class="outline-text-2" id="text-org4c0f633">
</div>
<div id="outline-container-org8244214" class="outline-3">
<h3 id="org8244214">Tools (Libs)</h3>
<div class="outline-text-3" id="text-org8244214">
</div>
<div id="outline-container-orgb869486" class="outline-4">
<h4 id="orgb869486">Utility</h4>
<div class="outline-text-4" id="text-orgb869486">
</div>
<div id="outline-container-org17b12e0" class="outline-5">
<h5 id="org17b12e0">Flatten</h5>
<div class="outline-text-5" id="text-org17b12e0">
<p>
Flatten list of iterable objects.
</p>

<div class="org-src-container">
<pre class="src src-python"><span class="org-keyword">from</span> napy.tools <span class="org-keyword">import</span> flatten, flatten_str

<span class="org-builtin">list</span><span class="org-rainbow-delimiters-depth-1">(</span>flatten<span class="org-rainbow-delimiters-depth-2">(</span><span class="org-rainbow-delimiters-depth-3">[</span>1, 2, <span class="org-string">"ab"</span>, <span class="org-rainbow-delimiters-depth-4">[</span>3, <span class="org-string">"c"</span>, <span class="org-rainbow-delimiters-depth-5">[</span>4, <span class="org-rainbow-delimiters-depth-6">[</span><span class="org-string">"d"</span><span class="org-rainbow-delimiters-depth-6">]</span><span class="org-rainbow-delimiters-depth-5">]</span><span class="org-rainbow-delimiters-depth-4">]</span><span class="org-rainbow-delimiters-depth-3">]</span><span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">[1, 2, "ab", 3, "c", 4, "d"]</span>

<span class="org-builtin">list</span><span class="org-rainbow-delimiters-depth-1">(</span>flatten<span class="org-rainbow-delimiters-depth-2">(</span><span class="org-string">"abc"</span><span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">["a", "b", "c"]</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">regard "abc" as ["a", "b", "c"]</span>

<span class="org-builtin">list</span><span class="org-rainbow-delimiters-depth-1">(</span>flatten_str<span class="org-rainbow-delimiters-depth-2">(</span><span class="org-rainbow-delimiters-depth-3">[</span>1, 2, <span class="org-string">"ab"</span>, <span class="org-rainbow-delimiters-depth-4">[</span>3, <span class="org-string">"c"</span>, <span class="org-rainbow-delimiters-depth-5">[</span>4, <span class="org-rainbow-delimiters-depth-6">[</span><span class="org-string">"d"</span><span class="org-rainbow-delimiters-depth-6">]</span><span class="org-rainbow-delimiters-depth-5">]</span><span class="org-rainbow-delimiters-depth-4">]</span><span class="org-rainbow-delimiters-depth-3">]</span><span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">or list(flatten([1, 2, "ab", [3, "c", [4, ["d"]]]], True))</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">[1, 2, "a", "b", 3, "c", 4, "d"]</span>
</pre>
</div>
</div>
</div>
</div>
</div>

<div id="outline-container-org0125dcb" class="outline-3">
<h3 id="org0125dcb">Comand Line Tools</h3>
<div class="outline-text-3" id="text-org0125dcb">
</div>
<div id="outline-container-orgd6f4dde" class="outline-4">
<h4 id="orgd6f4dde">Template</h4>
<div class="outline-text-4" id="text-orgd6f4dde">
</div>
<div id="outline-container-orgf74b16a" class="outline-5">
<h5 id="orgf74b16a">Crawler</h5>
<div class="outline-text-5" id="text-orgf74b16a">
<div class="org-src-container">
<pre class="src src-shell">$ napy template --help
Usage:
  template <span class="org-rainbow-delimiters-depth-1">[</span>options<span class="org-rainbow-delimiters-depth-1">]</span>

Options:
  -c, --category<span class="org-rainbow-delimiters-depth-1">[</span>=CATEGORY<span class="org-rainbow-delimiters-depth-1">]</span>       Category of template
  -o, --output<span class="org-rainbow-delimiters-depth-1">[</span>=OUTPUT<span class="org-rainbow-delimiters-depth-1">]</span>           Output file <span class="org-rainbow-delimiters-depth-1">(</span>default: <span class="org-string">"stdout"</span><span class="org-rainbow-delimiters-depth-1">)</span>
  -y, --yes                       Confirmation
  -h, --help                      Display this help message
  -q, --quiet                     Do not output any message
  -V, --version                   Display this application version
      --ansi                      Force ANSI output
      --no-ansi                   Disable ANSI output
  -n, --no-interaction            Do not ask any interactive question
  -v|vv|vvv, --verbose<span class="org-rainbow-delimiters-depth-1">[</span>=VERBOSE<span class="org-rainbow-delimiters-depth-1">]</span>  Increase the verbosity of messages: 1 for normal output, 2 for more verbose output and 3 for debug

Help:
 Template command line tool.
</pre>
</div>

<p>
It will generate this:
</p>

<div class="org-src-container">
<pre class="src src-python"><span class="org-keyword">from</span> requests_html <span class="org-keyword">import</span> HtmlSession <span class="org-keyword">as</span> s
<span class="org-keyword">import</span> requests <span class="org-keyword">as</span> req


<span class="org-keyword">def</span> <span class="org-function-name">crawler</span><span class="org-rainbow-delimiters-depth-1">()</span> -&gt; <span class="org-constant">None</span>:
    <span class="org-doc">"""Crawler."""</span>
    <span class="org-keyword">pass</span>


<span class="org-keyword">if</span> <span class="org-builtin">__name__</span> == <span class="org-string">"__main__"</span>:
    <span class="org-keyword">pass</span>
</pre>
</div>
</div>
</div>
</div>
</div>

<div id="outline-container-orgf70df2c" class="outline-3">
<h3 id="orgf70df2c">More</h3>
<div class="outline-text-3" id="text-orgf70df2c">
<p>
Still under development.
</p>
</div>
</div>
</div>

<div id="outline-container-orgbfc6b24" class="outline-2">
<h2 id="orgbfc6b24">Packages</h2>
<div class="outline-text-2" id="text-orgbfc6b24">
</div>
<div id="outline-container-org36ee374" class="outline-3">
<h3 id="org36ee374">Normal</h3>
<div class="outline-text-3" id="text-org36ee374">
<dl class="org-dl">
<dt>better_exceptions</dt><dd>Pretty and helpful exceptions, automatically.</dd>
<dt>pendulum</dt><dd>Python datetimes made easy.</dd>
<dt>tqdm</dt><dd>Fast, Extensible Progress Meter.</dd>
</dl>
</div>
</div>

<div id="outline-container-orgd37fc2d" class="outline-3">
<h3 id="orgd37fc2d">Science</h3>
<div class="outline-text-3" id="text-orgd37fc2d">
<dl class="org-dl">
<dt>jupyter :: Jupyter Notebook + IPython</dt><dd>Jupyter metapackage. Install all the Jupyter components in
one go.</dd>
<dt>numpy</dt><dd>NumPy: array processing for numbers, strings, records, and objects</dd>
<dt>pandas</dt><dd>Powerful data structures for data analysis, time series, and statistics</dd>
<dt>sympy</dt><dd>Computer algebra system (CAS) in Python</dd>
</dl>
</div>
</div>

<div id="outline-container-org731cb5c" class="outline-3">
<h3 id="org731cb5c">Crawler</h3>
<div class="outline-text-3" id="text-org731cb5c">
<dl class="org-dl">
<dt>requests</dt><dd>Python HTTP for Humans.</dd>
<dt>requests_html</dt><dd>HTML Parsing for Humans.</dd>
<dt>BeautifulSoup4</dt><dd>Screen-scraping library</dd>
</dl>
</div>
</div>

<div id="outline-container-org4368085" class="outline-3">
<h3 id="org4368085">Development</h3>
<div class="outline-text-3" id="text-org4368085">
<dl class="org-dl">
<dt>cleo</dt><dd>Cleo allows you to create beautiful and testable command-line interfaces.</dd>
</dl>
</div>
</div>
</div>

<div id="outline-container-org746629e" class="outline-2">
<h2 id="org746629e">Epoligue</h2>
<div class="outline-text-2" id="text-org746629e">
</div>
<div id="outline-container-org99c0952" class="outline-3">
<h3 id="org99c0952">History</h3>
<div class="outline-text-3" id="text-org99c0952">
</div>
<div id="outline-container-orgb1967c6" class="outline-4">
<h4 id="orgb1967c6">0.2.1 <span class="timestamp-wrapper"><span class="timestamp">&lt;2018-12-22 Sat&gt;</span></span></h4>
<div class="outline-text-4" id="text-orgb1967c6">
<p>
Add a new tool flatten
</p>
</div>
</div>

<div id="outline-container-orgdf92ad6" class="outline-4">
<h4 id="orgdf92ad6">0.1.1 <span class="timestamp-wrapper"><span class="timestamp">&lt;2018-12-17 Mon&gt;</span></span></h4>
<div class="outline-text-4" id="text-orgdf92ad6">
<p>
Use README.md instead of README.org
</p>
</div>
</div>

<div id="outline-container-org9172853" class="outline-4">
<h4 id="org9172853">0.1.0 <span class="timestamp-wrapper"><span class="timestamp">&lt;2018-12-16 Sun&gt;</span></span></h4>
<div class="outline-text-4" id="text-org9172853">
<p>
The beginning of everything
</p>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2018-12-11 Tue 00:00</p>
<p class="author">Author: Nasy</p>
<p class="date">Created: 2018-12-22 Sat 22:17</p>
<p class="validation"></p>
</div>
</body>
</html>
